## Pre-processing of data on RAINFALL amount in Peru in 2006-2015

#### Dataset used:

The dataset which is used for the analysis is the World Bank's Climate Change Knowledge Portal historical data on monthly average rainfall amount in Peru during 1991-2015, which can be accessed using the link: http://sdwebx.worldbank.org/climateportal/index.cfm?page=downscaled_data_download&menu=historical

**Step 1**: Importing neccessary package and loading the raw data file

In [1]:
import pandas as pd

RFPdata="https://github.com/vzakhozhyi/599-A-Final-Project/raw/master/Data%20Original/Rainfall_Peru.xls"
RFP=pd.read_excel(RFPdata)

Checking the uploaded data. For that, we can use **shape** function. It is a dataframe with 6 variables (columns) and 300 observations (rows)

In [12]:
RFP.shape

(300, 6)

Function **head()** shows first 5 rows (by default) of the dataframe. To change the number of rows visible, just indicate desired number in ( ).

In [13]:
RFP.head(10)

         pr  \tYear   Month  Country   ISO3   ISO2
0  110.7720    1991       1      PER    NaN    NaN
1  149.8710    1991       2      PER    NaN    NaN
2  180.9780    1991       3      PER    NaN    NaN
3  113.0370    1991       4      PER    NaN    NaN
4  122.3220    1991       5      PER    NaN    NaN
5  104.7460    1991       6      PER    NaN    NaN
6   35.2588    1991       7      PER    NaN    NaN
7   51.8483    1991       8      PER    NaN    NaN
8   88.4582    1991       9      PER    NaN    NaN
9   98.1672    1991      10      PER    NaN    NaN

**Step 2**: Cleaning the data

From the previous step, we see that the dataset contains some irrelevant variables with missing values. We need to clean the data set. For that, we drop columns we do not need for the analysis.

In [3]:
RFPclean=RFP.drop(columns=[' ISO3', ' ISO2'])
RFPclean.head()

        pr  \tYear   Month  Country
0  110.772    1991       1      PER
1  149.871    1991       2      PER
2  180.978    1991       3      PER
3  113.037    1991       4      PER
4  122.322    1991       5      PER

Cleaning the dataset also includes changing names of the variables (columns). To check the current column names, use function **columns**:

In [15]:
RFPclean.columns

Index(['pr', '\tYear', ' Month', ' Country'], dtype='object')

To change the old column names, first create the list of new names, then create the dictionary connection old names with new names using **comprehension**, **zip** function, and **rename** function.

In [4]:
newnames=['rainfall', 'year', 'month', 'country']
newRFPnames={old:new for old,new in zip(RFPclean,newnames)}
RFPclean.rename(columns=newRFPnames,inplace=True)
RFPclean.head()

   rainfall  year  month country
0   110.772  1991      1     PER
1   149.871  1991      2     PER
2   180.978  1991      3     PER
3   113.037  1991      4     PER
4   122.322  1991      5     PER

The "country" variable uses PER as the value for Peru. Changing "PER" to "Peru" (using **replace** function) is important for making datasets matching easier.

On this stage, we also subset the dataset to the timeframe of our interest 2006-2015.

In [5]:
RFPclean['country']=RFPclean['country'].replace(['PER'], 'Peru')

In [6]:
Years = ['2006', '2007', '2008', '2009', '2010', '2011', '2012', '2013', '2014', '2015']
RFPclean = RFPclean[RFPclean.year.isin(Years)]
RFPclean.head()

     rainfall  year  month country
180   232.747  2006      1    Peru
181   198.380  2006      2    Peru
182   209.435  2006      3    Peru
183   160.209  2006      4    Peru
184   133.984  2006      5    Peru

This step also includes an index reset to start at 0

In [20]:
RFPclean.reset_index(drop=True).head()

   rainfall  year  month country
0   232.747  2006      1    Peru
1   198.380  2006      2    Peru
2   209.435  2006      3    Peru
3   160.209  2006      4    Peru
4   133.984  2006      5    Peru

**Step 3**: Creating a new file out of our cleaned data and saving it as .csv file

In [145]:
RFPclean.to_csv("PeruRainfallFinal.csv",index=None)